#include <iostream>
#include <fstream> // За работа с файлове
using namespace std;

int main() {
    system("chcp 1251 > nul"); // Осигурява правилно изобразяване на кирилица

    ofstream файлПисане("данни.txt"); // Отваря или създава файл за записване
    if (файлПисане.is_open()) {
        файлПисане << "Здравей, свят!" << endl;
        файлПисане << "Това е пример за запис във файл." << endl;
        файлПисане.close(); // Затваря файла
        cout << "Данните са записани успешно." << endl;
    }
    else {
        cout << "Неуспешно отваряне на файла." << endl;
    }

    return 0;
}
