#include <iostream>
using namespace std;

class Животно {
public:
    void говори() {
        cout << "Животното издава звук." << endl;
    }
};

class Куче : public Животно {
public:
    void говори() {
        cout << "Кучето лае." << endl;
    }
};

int main() {
    system("chcp 1251 > nul"); // Осигурява правилно изобразяване на кирилица

    Животно животно;
    Куче куче;

    животно.говори(); // Извиква метода на базовия клас
    куче.говори(); // Извиква метода на наследника

    return 0;
}
