#include <iostream>
using namespace std;

class БанковаСметка {
private:
    double баланс;

public:
    БанковаСметка(double началенБаланс) {
        баланс = началенБаланс;
    }

    void депозирай(double сума) {
        if (сума > 0) {
            баланс += сума;
            cout << "Депозирани са " << сума << " лева." << endl;
        }
    }

    double покажиБаланс() {
        return баланс;
    }
};

int main() {
    system("chcp 1251 > nul"); // Осигурява правилно изобразяване на кирилица

    БанковаСметка сметка(1000); // Създаване на обект с начален баланс
    сметка.депозирай(500); // Депозиране на средства
    cout << "Балансът е: " << сметка.покажиБаланс() << " лева." << endl;

    return 0;
}
